a = input('Введите число от 3-х до 20-ти: ')
while a.isdigit() is False:  # Проверка корректности ввода числа
    print('Ошибка ввода, попробуйте заново')
    a = input('Введите число от 3-х до 20-ти: ')
else:
    n = int(a)
    while n < 3 or n > 20:  # Проверка корректности диапазона ввода числа
        print('Ошибка ввода, попробуйте заново')
        n = int(input('Введите число от 3-х до 20-ти: '))
    result = str()
    for i in range(1, n // 2 + 1):  # Вычисление пароля
        for j in range(i, n):
            if n % (i + j) == 0:
                if i == j:
                    continue
                else:
                    result = result + str(i) + str(j)
    print('Нужный пароль: ', result)

# Все пароли для чисел от 3 до 20 (для сверки):
# 3 - 12
# 4 - 13
# 5 - 1423
# 6 - 121524
# 7 - 162534
# 8 - 13172635
# 9 - 1218273645
# 10 - 141923283746
# 11 - 11029384756
# 12 - 12131511124210394857
# 13 - 112211310495867
# 14 - 1611325212343114105968
# 15 - 1214114232133124115106978
# 16 - 1317115262143531341251161079
# 17 - 11621531441351261171089
# 18 - 12151811724272163631545414513612711810
# 19 - 118217316415514613712811910
# 20 - 13141911923282183731746416515614713812911
